app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ?  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds"
---
  def index
    render :json => Feed.all, include: :latest_entries

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ? ORDER BY title desc  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 4]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy